{"authorDailyContributionsMap":{"Yukun99":[{"date":"2021-08-14","commitResults":[{"hash":"7cec7197fdf6f658e1464407b23fba8fb0c468e8","messageTitle":"Make Duke follow OOP","messageBody":"To follow OOP, we make the Duke bot an Object, which can be instantiated multiple times. This allows us to create instances of the Duke bot elsewhere, even from other applications.\n\nTo further improve code clarity, I moved the entry point of the program to the Main class, along with the Main method. The Duke class has further been renamed to HelpBot to allow anyone to name the bot however they like.\n\nIn my case, I have specified the logo in the main class as a constant, that I now pass through to the HelpBot class as the bot\u0027s name.\n\nFinally, javadocs have been added to the classes for documentation purposes, and the test batch file has been edited to run the new main class.\n","fileTypesAndContributionMap":{"java":{"insertions":42,"deletions":10},"bat":{"insertions":1,"deletions":1}}},{"hash":"6abaf7416f97ebf983f15baa12cecc56caef5a14","messageTitle":"HelpBot: Add simple reply and exit","messageBody":"","tags":["Level-1"],"fileTypesAndContributionMap":{"java":{"insertions":47,"deletions":8}}},{"hash":"da8b48122787bc0118da110ea924078d375e2a09","messageTitle":"HelpBot: add ability to add/list task","messageBody":"Test files have also been updated to reflect the actual code.\n","tags":["Level-2"],"fileTypesAndContributionMap":{"txt":{"insertions":4,"deletions":0},"java":{"insertions":36,"deletions":5}}},{"hash":"042283cf0c8cb6109d010baae2cbc9095a621644","messageTitle":"Add ability to mark tasks as done","messageBody":"Right now, the tasks are kept track of in a List of Strings, and the number of commands has increased to 3, with new and more complex commands being added.\n\nTo allow us to easily keep track of tasks and their status, it is easier to create a new Task object to keep track of this information, instead of storing the tasks in a List. We therefore add Task.java to create these objects, instantiating them with a name and completion value of false.\n\nSince the number of commands is starting to grow as well, an enum containing all the types of commands is now a better way of keeping the user command input method easy to understand. To use this enum, we add getCommand to HelpBot.java to parse the text inputs for command variables. In future, we can easily edit this method if we ever want to add more command parsing to our bot, and we can easily edit the enum to add more commands.\n\nWith the new command requiring us to get an integer from the second word of the command, and future commands possibly needing this too, we add a new class Methods.java to contain commonly used methods across multiple classes. The first method we add here is isInt(String message), which checks if a given String is an int.\n","tags":["Level-3","A-Classes"],"fileTypesAndContributionMap":{"txt":{"insertions":8,"deletions":3},"java":{"insertions":131,"deletions":22}}}]},{"date":"2021-08-15","commitResults":[{"hash":"d964f325f86aade3647ef814c21bf965447a0a30","messageTitle":"Add multiple types of tasks","messageBody":"Currently, we have one type of task, which may not be enough for users who want to set deadlines for their tasks, or plan their time better.\n\nTo make sure that the code is readable, we create three classes, one for each of the new task types. They all extend the main Task.java class, so we can easily call methods from the main class to access the other classes.\n\nSince users now have access to tasks that have dates as well, users may change their mind on when they want these tasks to be fulfilled. To allow this, we add the ability to update the deadline and date for the deadlines and events respectively.\n\nTo keep track of tasks to edit, we use our List of all the tasks, which we can use to easily reference tasks in the correct index to update. An abstract method updateDate in Task.java is added to allow its children to inherit the method. The Todo.java class throws an IllegalStateException when this method is called since it does not have the date field required to be updated.\n\nWe add the method getTaskAmount to return us the number of total tasks when we add a new task. We also add the method onEnableMessage to handle sending the welcome message to new users, now with instructions on how to use the bot, of course with the same passive aggressive spin.\n","tags":["Level-4","A-Packages","A-Inheritance","A-Enums"],"fileTypesAndContributionMap":{"txt":{"insertions":11,"deletions":4},"java":{"insertions":416,"deletions":184}}},{"hash":"a93d03c239bd439c3d1607e8404cf1bfcd5af1f1","messageTitle":"Amend testing files","messageBody":"Presently, javac is used to compile the files and test them. This was easier when the app was not in multiple packages, however with the splitting of classes into different packages, it has become easier to build an artifact and use the java -jar command to run that instead.\n\nTo do this, I build the project artifact in the IDE, which gives me the updated ip.jar. This allows me to run the script test.bat on it, which takes in the input and creates the file ACTUAL.TXT. Finally, the FC results are saved to results.txt to allow us to view it afterwards.\n","tags":["A-TextUiTesting"],"fileTypesAndContributionMap":{"txt":{"insertions":3,"deletions":0},"java":{"insertions":0,"deletions":2},"bat":{"insertions":4,"deletions":21},"sh":{"insertions":0,"deletions":38}}},{"hash":"45d02cb56bc3c1a415e9c7ac33a7ce0f4bcd8ae3","messageTitle":"Add error handling","messageBody":"Currently, error handling uses some of Java\u0027s own errors, as well as methods situated in the Methods.java class. To make errors more useful and informative to users, we should create new errors specific to the bot.\n\nTo do this, we create the class HelpBotException.java, which is the overarching class for all of the errors the bot may face. We divide this into two cases for now, the InvalidTaskType and InvalidTask exceptions. The former is called if the user tries to perform an action on the wrong task type, while the latter is called if the user tries to perform an action on a task that does not exist.\n\nFollowing the changes, we remove Methods.java as error handling has been moved elsewhere. Update EXPECTED.TXT to reflect new messages related to errors.\n","tags":["Level-5","A-Exceptions"],"fileTypesAndContributionMap":{"java":{"insertions":96,"deletions":36}}},{"hash":"bf8dfaf5d201c132de01c82a8f91e4bf429faeb3","messageTitle":"Improve commands and errors","messageBody":"Presently, we do not have a command for the default case of adding tasks to the bot. This could result in confusing cases where users type something wrong into the bot and the typo gets added as a task.\n\nTo fix this, we add a new command \"todo\" to handle the case where users want to add a todo item to their task list. The default case for user messages to the bot is now an error telling the user that the entered command is invalid.\n\nWe also add other error classes to help differentiate between the new errors users may face. We add a new HelpBotIllegalArgumentException as a general error that refers to commands with wrong arguments, with InvalidTaskException being a more specific form relating to the task specified by a command being invalid.\n\nUpdate onEnableMessage to reflect new command and add documentation to the method. Update test cases to reflect the changes. Update .gitignore to stop pushing results.txt to remote.\n","tags":["Level-5.1"],"fileTypesAndContributionMap":{"txt":{"insertions":9,"deletions":5},"java":{"insertions":118,"deletions":53}}},{"hash":"4ae95b06e2a0859fd19042a98310342c979c3ac0","messageTitle":"Add task deleting functionality","messageBody":"With the ability to mark tasks as completed a few updates ago, users can now keep track of their tasks. However, this could result in clutter if the completed tasks remain on the list of tasks.\n\nAdd deleteTask method to Task.java to allow users to delete tasks, as well as handle messaging users for a reply. Move getTaskAmount method to Task.java since the tasks are stored there.\n\nRename IllegalCommandException to InvalidCommandException to more accurately reflect the nature of the exception. Rewrote reply message for InvalidTaskException for more clarity when debugging.\n\nUpdated test files to match updates.\n","tags":["Level-6"],"fileTypesAndContributionMap":{"txt":{"insertions":5,"deletions":0},"java":{"insertions":93,"deletions":23}}}]},{"date":"2021-08-21","commitResults":[{"hash":"b3f820b6f52f45df0e6b0dee4d3c7a1bcf685161","messageTitle":"Add more OOP","messageBody":"Right now, we do not have our commands, task list and command parser in separate classes. This means that as we add more commands, the method count in the HelpBot class will keep increasing, making it increasingly hard to keep track of.\n\nTo fix this, we create new Command objects for each of the individual commands, which we can run and handle errors easily for. The new Ui class handles text replies and formatting. The TaskList class is created to do operations on tasks and keep track of the list of tasks. Finally, the Parser class centralises the parsing of commands.\n\nThis centralises error handling to HelpBot class to allow us to see at a glance what goes wrong. Tracing errors to individual commands is also easier. New commands are easily added to the Parser and new children of the Command class can be created for commands added in future.\n\nUpdate test files to match updates.\n","tags":["A-MoreOOP"],"fileTypesAndContributionMap":{"txt":{"insertions":1,"deletions":0},"java":{"insertions":514,"deletions":334}}},{"hash":"701cc10e7a7ba1adea1a9048f7ad42394facfa06","messageTitle":"Add Javadocs","messageBody":"Right now, after adding more classes to follow OOP, we have not updated our Javadocs in the new classes to match what we have done before. The convention of Javadocs was also not correct before.\n\nAdd Javadocs to all methods and classses, and comments to all variables to tell myself and other developers what they mean. Methods and classes that are inherited from others or extend others are not included. Also make slight changes to bot\u0027s responses for personality reasons.\n\nThis allows us to pick up right where we left off if we do not work on the project for a few days. Other developers can easily use or hook into our project to further build on it.\n\nUpdate test files to match updates.\n","tags":["A-JavaDoc"],"fileTypesAndContributionMap":{"java":{"insertions":167,"deletions":16}}},{"hash":"8664a7ff4bc8728632639558fa9f104b777c8a8c","messageTitle":"Add Storage.java","messageBody":"Right now, we only accept user input from System.in. Although users can specify files to move files in, we could add the functionality to the bot to automatically load commands and save results to files.\n\nAdd Storage.java to handle IO to and from files. Because of this, we rewrite some classes to allow for the new file saving functionality, mainly in Ui, where we save the replies from our bot. We still keep the System.in input format if a file is not provided for input.\n\nThis allows users to have an easier time using our bot, since they can just copy the file over and run the jar file instead of using the command line to do so. Keeping System.in as an alternative form of input allows users of the bot to still use it without having to put all their commands in a file.\n\nUpdate test files to match updates.\n","tags":["A-Storage"],"fileTypesAndContributionMap":{"txt":{"insertions":0,"deletions":0},"java":{"insertions":90,"deletions":21},"bat":{"insertions":2,"deletions":2}}}]},{"date":"2021-08-22","commitResults":[{"hash":"63e472b913ad9dbf65e2e71bd547f8ccaa4e8708","messageTitle":"Delete text-ui-test directory","messageBody":"","fileTypesAndContributionMap":{"txt":{"insertions":0,"deletions":29},"bat":{"insertions":0,"deletions":4}}},{"hash":"585d6ddb07866fadf7497bec44a33b3a4eb9cbab","messageTitle":"Add File Saving/Loading","messageBody":"Right now, the bot does not save the task list for users after they have used the bot. THis means that users lose their todo list everytime they close the bot.\n\nWe improved this by adding file writing and reading functionality for our list of tasks to the Storage class. This updates the file in real time as the user types commands into the bot.\n\nDoing this allows users to keep track of their tasks across different sessions of starting our bot. Updating the file in real time may be more resource intensive but it makes sure no data is lost in the event of a crash or accidental closure of the bot.\n","fileTypesAndContributionMap":{"txt":{"insertions":0,"deletions":0},"java":{"insertions":216,"deletions":18}}},{"hash":"189ac29efa8ca8a8123960a397acdb2126a578ef","messageTitle":"Add Date/Time support","messageBody":"Right now, the bot mere takes in date and time as strings. While this saves on a lot of backend error checking and parsing, it also means the information could be less useful for the user.\n\nWe improve this by making sure users input actual date and times in AddCommand. This means users now have to provide actual specific timings for their tasks. We make a new DateTimePair class to keep track of this within each Event and Deadline object. A new error is created to handle errors related to parsing date and time.\n\nDoing this allows users to have a more consistent experience, with all date and time print outs being in the same format. We are also able to fetch tasks by date, allowing users to see at a glance what they have to do on a certain day.\n\nMinor bug fixes have been made to deletion of task and parsing of various commands.\n","fileTypesAndContributionMap":{"java":{"insertions":358,"deletions":55}}}]},{"date":"2021-08-23","commitResults":[{"hash":"f78d5851848c6e62a252ee99f54b21f376ce1193","messageTitle":"Add Date/Time support","messageBody":"Right now, users may add only list all tasks, or list them by day. We want to add the ability to list tasks by keyword. This requires the bot to have the ability to search by keyword.\n\nWe add a new TaskFinder class to map keywords to corresponding tasks. A new command FindCommand is now used to parse and query the word needed to find new tasks. Changes are made to other existing classes to support the new feature.\n\nUsers may want to see recurring tasks of a similar nature together, or complete similar tasks at once. This allows them to easily find all tasks pertaining to a keyword.\n\nMinor improvements made to reply messages for more clarity on what query is being answered.\n","fileTypesAndContributionMap":{"java":{"insertions":135,"deletions":12}}}]},{"date":"2021-08-26","commitResults":[{"hash":"7827cad230318c4f285c2a388dcb8761938264e6","messageTitle":"Adhere to coding standard Remove \u0027this.\u0027 occurences outside of constructor Add missing Javadocs Bug fix for task list saving","messageBody":"","fileTypesAndContributionMap":{"java":{"insertions":188,"deletions":108}}}]},{"date":"2021-08-28","commitResults":[{"hash":"8ddf16fd3679204fec0fd8b92d2bdacebde9911b","messageTitle":"TaskFinder: Add JUnit tests","messageBody":"Add equals method to core classes to support JUnit testing.\n","tags":["A-JUnit"],"fileTypesAndContributionMap":{"java":{"insertions":139,"deletions":3}}}]},{"date":"2021-09-01","commitResults":[{"hash":"fac9b67c4ca84ab20b982449a222be35f2836d30","messageTitle":"Add Gradle Support","messageBody":"","tags":["A-Gradle"],"fileTypesAndContributionMap":{"gradle":{"insertions":22,"deletions":0},"bat":{"insertions":89,"deletions":0}}},{"hash":"1d0b6b9436a89bd17b9d82f712a026ab7d42fade","messageTitle":"Fix Checkstyle errors","messageBody":"","tags":["A-CheckStyle"],"fileTypesAndContributionMap":{"gradle":{"insertions":5,"deletions":0},"java":{"insertions":1548,"deletions":1505}}}]},{"date":"2021-09-03","commitResults":[{"hash":"756a39c641bf46bcb7718d3b2c71d88907709b0f","messageTitle":"Add GUI","messageBody":"Right now, we use the CLI for task entry, which is not aesthetically appealing to users. It is also hard for users to tell which comamnd is from the Bot.\n\nTo fix this, we create a new Window for all our messages and replies, as well as input and sending. The user and bot also have avatars now, which correspond to who sent the message.\n\nThis allows users to easily keep track of tasks, as well as enjoy chatting with the bot more.\n","fileTypesAndContributionMap":{"gradle":{"insertions":13,"deletions":5},"fxml":{"insertions":38,"deletions":0},"java":{"insertions":463,"deletions":397}}},{"hash":"91ed402aa8b72ff888fd96367a82b0c6dbcb0c1c","messageTitle":"Add Varargs","messageBody":"Right now, deletion of tasks is a tedious process, especially with the bug I introduced last update, which adds new tasks twice.\n\nTo fix this, I fix the bug first, then add the ability to parse multiple task numbers through to the delete command via the use of varargs.\n\nThis allows users to delete many tasks at once, and saves on time. The bot also has some new messages to go with this change.\n","tags":["A-Varargs"],"fileTypesAndContributionMap":{"java":{"insertions":83,"deletions":44}}}]},{"date":"2021-09-05","commitResults":[{"hash":"b4eea0a922a7c1ce35a810a348eb41aa60c936c2","messageTitle":"Add Assertions","messageBody":"Right now, we do not check if our Task Type is not null in our HelpBotInvalidTaskTypeException. This could lead to users being confused if I make a mistake of creating a task without the right type.\n\nTo fix this, we assert `type !\u003d null` in the constructor to make sure that this forces the application to exit instead of printing the wrong error.\n\nThis prevents confusion in the case of my error.\n","fileTypesAndContributionMap":{"java":{"insertions":3,"deletions":1}}},{"hash":"87f741dfe34fcebc0f094a0fdade1271eb6e083e","messageTitle":"Improve code quality","messageBody":"Right now, our code does not follow conventions in certain places.\n\nTo fix this, we make sure we explain empty catch blocks. We also make sure to include all information in our method javadocs.\n\nThis allows other developers to understand what we are doing.\n","fileTypesAndContributionMap":{"java":{"insertions":121,"deletions":62}}}]},{"date":"2021-09-09","commitResults":[{"hash":"8dfe9d7773c40ac6ce08d9922cb4f24883688f2e","messageTitle":"Add Archive Command","messageBody":"Previously, users could only delete tasks or mark them as done. Some users may want to archive tasks that could recur again. Tasks that get delayed could be kept for later as well to prevent cluttering of the task list.\n\nTo add this functionality, we add a new type of command object. We also add the corresponding messages. Finally, we allow our storage class to save the tasks to file accordingly. Methods in the TaskList and Storage class are also split to allow code sharing between different methods. This means we can add another useful delete all command using the new split classes.\n\nThis allows users to easily declutter their task list by archiving temporarily unused tasks. They could also easily bring back the archived tasks once they want to work on them again.\n","tags":["C-Update","C-Archive","BCD-Extension"],"fileTypesAndContributionMap":{"java":{"insertions":221,"deletions":36}}}]},{"date":"2021-09-11","commitResults":[{"hash":"e9b721be44319935ec5293e8abf533583bffd6c8","messageTitle":"Improve GUI","messageBody":"Right now, users may find it hard to differentiate between bot and user messages. They also need to perform commands to even see how many tasks they have left, or see how many of them are done. Error messages also look exactly like normal bot messages.\n\nTo fix this, we add a display for total tasks and completed tasks that updates whenever a command is run. We also make the messages occupy their own speech bubbles to look more like a chat window. The background has been changed to a dark background to make it easier on the eyes. Error messages have a different colour scheme to separate them from normal bot messages.\n\nThis allows users to see at a glance the amount of tasks that they have in the list, as well as easily tell which message is from the bot. Errors are also easily visible now.\n\nFix bugs with file saving.\nFix incomplete JavaDocs to follow coding standard.\n","tags":["A-BetterGui"],"fileTypesAndContributionMap":{"fxml":{"insertions":85,"deletions":13},"java":{"insertions":91,"deletions":22}}},{"hash":"09ee80e22fb2caac875307afe6cdd3c36384d003","messageTitle":"Update Screenshot","messageBody":"","tags":["Ui.png"],"fileTypesAndContributionMap":{"md":{"insertions":0,"deletions":24}}},{"hash":"e7e28c635de963f058076b6869b75723ffbf0106","messageTitle":"Add User Guide","messageBody":"","tags":["A-UserGuide"],"fileTypesAndContributionMap":{"java":{"insertions":36,"deletions":27},"md":{"insertions":251,"deletions":12}}}]}]},"authorFileTypeContributionMap":{"Yukun99":{"java":2358,"md":241,"fxml":110,"sh":0,"bat":89,"gradle":35,"txt":0}},"authorContributionVariance":{"Yukun99":364494.78},"authorDisplayNameMap":{"Yukun99":"CS2103T-W08-1 XU Y..UKUN"}}
